COUNTRY_NAMES = {
    "DE": "Німеччина",
    "AT": "Австрія",
    "BE": "Бельгія",
    "ES": "Іспанія",
    "FR": "Франція",
    "IT": "Італія",
    "LU": "Люксембург",
    "NL": "Нідерланди"
}

PRICE_OPTIONS = [
    500, 1000, 1500, 2000, 2500, 3000, 4000, 5000,
    6000, 7000, 8000, 9000, 10000, 12500, 15000,
    17500, 20000, 25000, 30000, 40000, 50000,
    75000, 100000
]

MILEAGE_OPTIONS = [
    2500, 5000, 10000, 20000, 30000, 40000, 50000,
    60000, 70000, 80000, 90000, 100000, 125000,
    150000, 175000, 200000
]

COUNTRY_CODES = {
    "Німеччина": "D",
    "Австрія": "A",
    "Бельгія": "B",
    "Іспанія": "E",
    "Франція": "F",
    "Італія": "I",
    "Люксембург": "L",
    "Нідерланди": "NL"
}

ENGINE_TYPES = {
    "Gasoline": "Бензин",
    "Diesel": "Дизель",
    "Electric": "Електро",
    "Electric/Gasoline": "Гібрид",
    "Electric/Diesel": "Гібрид",
    "LPG": "Газ",
    "Ethanol": "Газ (нафтовий газ)",
    "CNG": "Етанол",
    "Hydrogen": "Водень",
    "Others": "Інше"
}

BODY_TYPES = {
    "sedan": "Седан",
    "hatchback": "Хетчбек",
    "coupe": "Купе",
    "suv": "Позашляховик",
    "convertible": "Кабріолет",
    "wagon": "Універсал",
    "van": "Мінівен",
    "pickup": "Пікап",
}

TRANSMISSIONS = {
    "manual": "Механічна",
    "automatic": "Автоматична",
    "semiautomatic": "Напівавтоматична"
}

DRIVE_TYPES = {
    "fwd": "Передній",
    "rwd": "Задній",
    "awd": "Повний",
    "4wd": "Повний",
    "front": "Передній",
    "rear": "Задній",
    "all": "Повний"
}
